// JavaScript Document
<script>
        function DecodeJump(){
          var cURL = new Array();
          //ここに暗号化URLをコピーして下さい▽▽▽▽▽▽▽▽▽
          cURL[0] = "12465,12447,12461,12443,12475,12499,12534,12484,12461,12419,12459,12430,12461,12447,12472,12423,12469,12430,12448,12429,12449,12428,12469,12431,12535,12428,12464,12447,12448,12444,12475,12485,12464,12420,12534,12421,12457,12435,12470,12484,12534,12447,12463,12429,12457,12423,12458,12444,12476,12441,12478,12425";
          cURL[1] = "12465,12447,12461,12443,12315,12467,12374,12452,12461,12419,12459,12430,12301,12543,12312,12519,12469,12430,12448,12429,12289,12524,12309,12527,12535,12428,12464,12447,12288,12540,12315,12453,12464,12420,12534,12421,12297,12531,12310,12452,12534,12447,12463,12429,12297,12519,12298,12540,12476,12441,12478,12425";
          cURL[2] = "12305,12543,12301,12539,12315,12467,12374,12452,12301,12515,12299,12526,12301,12543,12312,12519,12309,12526,12288,12525,12289,12524,12309,12527,12375,12524,12304,12543,12288,12540,12315,12453,12304,12516,12374,12517,12297,12531,12310,12452,12374,12543,12303,12525,12297,12519,12298,12540,12316,12537,12318,12521";
          cURL[3] = "12305,12543,12301,12539,12475,12499,12534,12484,12301,12515,12299,12526,12461,12447,12472,12423,12309,12526,12288,12525,12449,12428,12469,12431,12375,12524,12304,12543,12448,12444,12475,12485,12304,12516,12374,12517,12457,12435,12470,12484,12374,12543,12303,12525,12457,12423,12458,12444,12316,12537,12318,12521";
        //ここに暗号化URLをコピーして下さい△△△△△△△△△
          var KeyWord;
          KeyWord = document.frmAngoukaJump.txtPasswordForDecode.value;
        
          re = new RegExp("http://www\.shiwehi\.com/.+\.php$", "i");//URLが左の形式に一致しているかを判定する
          //ここの記述はなるべく長いほうが誤作動が起きにくいです。URLの正規表現については調べてください。
          var str = new Array();
          for ( var k = 0; k <= cURL.length - 1; k++ ){
            str[k] = De(cURL[k],KeyWord);
          }
        
            if (str[0].match(re)) {
              document.location.href = str[0] ;//cURL[0]に設定された文字列が入力されたらcURL[0]に設定されたURLに遷移する
            } else if (str[1].match(re)) {
              document.location.href = str[1] ;//cURL[1]に設定された文字列が入力されたらcURL[1]に設定されたURLに遷移する
            } else if (str[2].match(re)) {
              alert("「あらーと」が入力されました。");//cURL[2]に設定された文字列が入力されたらアラートを出す。
            }else{
              alert("登録されていない文字列です。");//cURLに設定されていない単語が入力された。
            }
        }
        
        function MakeKey(Key,Nmb){
          var j;
          KeyBuff = new Array(Nmb);
          for(j=0;j < Nmb;j++){
            KeyBuff[j] = Key.substr(j % Key.length,1).charCodeAt(0);
          }
        }
        
        function De(str,mKey){
          var StrBuff = str.split(",");
          var LBuff = "";
          UB = StrBuff.length; MakeKey(mKey,UB);
          for(i = 0; i < UB;i++ ){
            StrBuff[i] = unescape(StrBuff[i]) ^ KeyBuff[i];
            LBuff = LBuff + String.fromCharCode(StrBuff[i]); 
          }
          return LBuff;
        }
</script>
